Repository: lawrancej/logisim
Catalog: xlate/ru/resources/omegat-logisim-resources_ru-level1.tmx
Source language: en
Languages: ru_ru

source: Could not load template: %s
ru_ru: Невозможно загрузить шаблон: %s

source: Active On High?
ru_ru: Активен при единице?

source: Length
ru_ru: Длина

source: Corner Radius
ru_ru: Радиус угла

source: Unload Library
ru_ru: Выгрузить библиотеку

source: Vertical Alignment
ru_ru: Вертикальное выравнивание

source: Supported locales:
ru_ru: Поддерживаемые языки:

source: Circuit Name
ru_ru: Название схемы

source: Reload Library
ru_ru: Перезагрузить библиотеку

source: Paste region must be same size as clipboard.
ru_ru: Область вставки должна быть того же размера, что буфер обмена.

source: New Window
ru_ru: Новое окно

source: Zero
ru_ru: Ноль

source: %sB RAM
ru_ru: %sБ ОЗУ

source: Pull Direction
ru_ru: Направление согласования

source: Lowest-order %s
ru_ru: Младший %s

source: Clock: memory value updates on rise from 0 to 1
ru_ru: Тактовый вход: значение в памяти обновляется при изменении с 0 на 1

source: Clear: 1 pins contents to 0 asynchronously
ru_ru: Очистка: 1 асинхронно фиксирует всё содержимое на 0

source: Data: value loaded or stored at address
ru_ru: Данные: значение, считываемое или записываемое по адресу

source: NAND Gate
ru_ru: Элемент И-НЕ

source: Creating window...
ru_ru: Создание окна...

source: File Not Available
ru_ru: Файл не доступен

source: -empty use empty template
ru_ru: -empty использовать пустой шаблон

source: Append
ru_ru: Дополнить

source: Output: address of highest-indexed 1 input
ru_ru: Выход: адрес старшего по номеру входа, на котором 1

source: No output selected.
ru_ru: Выход не выбран.

source: View log of recent values.
ru_ru: Просмотреть журнал последних значений.

source: Cannot Remove Library
ru_ru: Невозможно удалить библиотеку

source: Image file has some invalid contents.
ru_ru: Файл образа имеет неверное содержимое.

source: Roll Left
ru_ru: Циклический левый

source: OR Gate
ru_ru: Элемент ИЛИ

source: 2's Complement
ru_ru: Дополнительный код

source: Select Value
ru_ru: Выбор значения

source: Change Circuit
ru_ru: Изменить схему

source: Bottom-
ru_ru: По низу

source: Load Image...
ru_ru: Загрузить образ...

source: Minimize
ru_ru: Минимизировать

source: Scale Factor:
ru_ru: Масштабный коэффициент:

source: Disable
ru_ru: Выключить

source: Fan Out
ru_ru: Веерный выход

source: Circuits cannot have identical names.
ru_ru: Схемы не могут иметь одинаковые имена.

source: Output %s
ru_ru: Выход %s

source: Buffer
ru_ru: Буфер

source: Lower Selection
ru_ru: Опустить выделение

source: Data: value loaded from address
ru_ru: Данные: значение, считываемое по адресу

source: Copy
ru_ru: Копировать

source: Paste
ru_ru: Вставить

source: Creating template...
ru_ru: Создание шаблона...

source: Logging...
ru_ru: Запись в журнал...

source: Preferences
ru_ru: Настройки

source: Center-
ru_ru: По центру

source: Template file %s does not exist.
ru_ru: Файл шаблона %s не существует.

source: Logisim: Preferences
ru_ru: Logisim: настройки

source: Printer View:
ru_ru: Вид для печати:

source: Error duplicating file: %s
ru_ru: Ошибка дублирования файла: %s

source: Read enable: 0 disables clock
ru_ru: Разрешение записи: 0 отключает тактовый вход

source: Available: 1 when buffer contains characters
ru_ru: Наличие: 1, когда буфер содержит символы

source: Cannot Print
ru_ru: Невозможно напечатать

source: Multiplier
ru_ru: Множитель

source: Clock: trigger consumes the buffer's front character
ru_ru: Тактовый вход: срабатывание считывает первый символ буфера

source: Combinational Analysis
ru_ru: Комбинационный анализ

source: When one input is on
ru_ru: Когда на одном входе 1

source: Operator %s missing right operand.
ru_ru: Для оператора %s отсутствует правый операнд.

source: Select Bits
ru_ru: Выбирающие биты

source: Edit circuit components
ru_ru: Редактировать компоненты схемы

source: Pen Color
ru_ru: Цвет линии

source: Add Vertex
ru_ru: Добавить вершину

source: Shaped
ru_ru: Фигурные

source: location of component `%s' is invalid (%s)
ru_ru: расположение компонента `%s' не верно (%s)

source: Rising Edge
ru_ru: Передний фронт

source: -version display version number and exit
ru_ru: -version отобразить номер версии и выйти

source: Pen Width
ru_ru: Толщина линии

source: Output: result of shifting the input
ru_ru: Выход: результат сдвига входного значения

source: ROM
ru_ru: ПЗУ

source: About...
ru_ru: О программе...

source: West
ru_ru: Запад

source: -load file load image file into RAM (works with -tty only)
ru_ru: -load файл загрузить файл образа в ОЗУ (работает только с -tty)

source: Header:
ru_ru: Заголовок:

source: You must select a destination project.
ru_ru: Вы должны выбрать целевой проект.

source: Unrecognized library descriptor %s
ru_ru: Неизвестный дескриптор библиотеки %s

source: Duplicate Selection
ru_ru: Дублировать выделение

source: Rectangular
ru_ru: Прямоугольные

source: Shorten Wire
ru_ru: Укоротить провод

source: Input: the number to be negated
ru_ru: Вход: число для инвертирования

source: Leave Unchanged
ru_ru: Не менять

source: Graphics acceleration:
ru_ru: Ускорение графики:

source: Output Bits
ru_ru: Выходные биты

source: Tick
ru_ru: такт

source: Clear: When 1, pin state to 0 asynchronously
ru_ru: Очистка: когда 1, состояние асинхронно фиксируется на 0

source: Legacy
ru_ru: Устаревшие

source: Creating project...
ru_ru: Создание проекта...

source: Left-Handed
ru_ru: По левую руку

source: Logisim: %s Statistics
ru_ru: Logisim: статистика %s

source: Value must be at least %s.
ru_ru: Значение должно быть как минимум %s.

source: Change Tool Attribute
ru_ru: Изменить атрибут инструмента

source: Could not display help data.
ru_ru: Невозможно отобразить данные справки.

source: -tty requires at least one of the following: halt, speed, stats, table, tty
ru_ru: -tty требует по крайней мере один из следующих аргументов: halt, speed, stats, table, tty

source: Joystick
ru_ru: Джойстик

source: -locale str use locale given in str
ru_ru: -locale str использовать язык, указанный в str

source: Expression
ru_ru: Выражение

source: Negator
ru_ru: Отрицатель

source: wire end misformatted
ru_ru: конец провода имеет неверный формат

source: Menu Tool
ru_ru: Инструмент Меню

source: Text Tool
ru_ru: Инструмент Текст

source: mouse mapping modifier missing
ru_ru: отсутствует модификатор привязки мыши

source: Build Circuit
ru_ru: Построить схему

source: Load Libraries
ru_ru: Загрузить библиотеки

source: Conflicting outputs detected; computing truth table instead.
ru_ru: Обнаружены конфликтующие выходы; составляется таблица истинности.

source: All built-in libraries are already loaded.
ru_ru: Все встроенные библиотеки уже загружены.

source: Set As Main Circuit
ru_ru: Сделать главной схемой

source: Horizontal Alignment
ru_ru: Горизонтальное выравнивание

source: Duplicate
ru_ru: Дублировать

source: Divisor: the number by which to divide
ru_ru: Делитель: число, на которое делить

source: Rectangle
ru_ru: Прямоугольник

source: Input: bits to be shifted
ru_ru: Вход: биты для сдвига

source: Polyline
ru_ru: Ломаная

source: Line
ru_ru: Линия

source: Logisim Library...
ru_ru: Библиотека Logisim...

source: No matching opening parenthesis.
ru_ru: Нет соответствующей открывающей скобки.

source: library `%s' not found
ru_ru: библиотека `%s' не найдена

source: Conflicting component already there.
ru_ru: Здесь уже конфликтующий компонент.

source: Tunnel
ru_ru: Тоннель

source: Horizontal
ru_ru: Горизонтальный

source: Edit Tool
ru_ru: Инструмент Правка

source: Cannot create circular reference.
ru_ru: Невозможно создать циклическую ссылку.

source: Binary
ru_ru: Двоичное

source: Load Built-in Library
ru_ru: Загрузить библиотеку

source: Change Component Attributes
ru_ru: Изменить атрибуты компонента

source: Pull Resistor
ru_ru: Согласующий резистор

source: NOR Gate
ru_ru: Элемент ИЛИ-НЕ

source: Circuit '%s' uses components from the library.
ru_ru: Схема '%s' использует компоненты из библиотеки.

source: Paint Type
ru_ru: Тип отрисовки

source: Gate Size
ru_ru: Размер элемента

source: Arithmetic Right
ru_ru: Арифметический правый

source: Bit Extender
ru_ru: Расширитель битов

source: Controlled Buffer
ru_ru: Управляемый буфер

source: -sub file1 file2 load file replacing library file1 with file2
ru_ru: -sub файл1 файл2 загрузить файл, заменив библиотеку файл1 на файл2

source: Less: 1 if A is less than B
ru_ru: Меньше: 1, если A меньше, чем B

source: Ticks Enabled
ru_ru: Такты включены

source: wire start not defined
ru_ru: начало провода не определено

source: Select Export File
ru_ru: Выбор файла для экспорта

source: Include Header Line
ru_ru: Добавить строку заголовка

source: Clear: When 1, pin value to 0 asynchronously
ru_ru: Очистка: когда 1, значение асинхронно фиксируется на 0

source: Analysis cannot handle multibit outputs.
ru_ru: Анализ не может манипулировать многобитными выходами.

source: Help data not found.
ru_ru: Данные справки не найдены.

source: Please select the file from the following dialog.
ru_ru: Пожалуйста, выберите файл из следующего диалога.

source: Select Rows/Columns
ru_ru: Выбор Строки/Столбцы

source: Radix
ru_ru: Основание

source: No non-empty circuits are available for export.
ru_ru: Нет непустых схем, доступных для экспорта.

source: Signed Decimal
ru_ru: Знаковое десятичное

source: Experimental
ru_ru: Экспериментальные

source: Continue counting
ru_ru: Продолжать счёт

source: Highest-order %s
ru_ru: Старший %s

source: Name cannot contain '%s'.
ru_ru: Имя не может содержать '%s'.

source: No RAM was found for the "-load" option.
ru_ru: Не было найдено ОЗУ для паремтра "-load".

source: Rows
ru_ru: Строки

source: Error loading circuit file: %s
ru_ru: Ошибка при загрузке файла схемы: %s

source: Objects
ru_ru: Объекты

source: TOTAL (without project's subcircuits)
ru_ru: ВСЕГО (без подсхем проекта)

source: Clock
ru_ru: Тактовый генератор

source: The "-sub" option must be followed by two parameters.
ru_ru: Параметр "-sub" должен сопровождаться двумя аргументами.

source: Preferences...
ru_ru: Настройки...

source: Center
ru_ru: Центр

source: Logisim: %s Options
ru_ru: Logisim: параметры %s

source: Save Image...
ru_ru: Сохранить образ...

source: No matching closing parenthesis.
ru_ru: Нет соответствующей закрывающей скобки.

source: Select Template
ru_ru: Выбрать шаблон

source: %sB ROM
ru_ru: %sБ ПЗУ

source: Unsigned Decimal
ru_ru: Беззнаковое десятичное

source: Add noise to component delays
ru_ru: Добавить шум к задержкам компонентов

source: Remove Circuit
ru_ru: Удалить схему

source: Select Libraries To Unload
ru_ru: Выгрузить библиотеки

source: Every circuit requires a name.
ru_ru: Каждая схема требует имя.

source: library descriptor missing
ru_ru: отсутствует дескриптор библиотеки

source: Cannot Save File
ru_ru: Невозможно сохранить файл

source: Hexadecimal
ru_ru: Шестнадцатеричное

source: XNOR Gate
ru_ru: Элемент Исключающее ИЛИ-НЕ

source: Could not close file: %s
ru_ru: Невозможно закрыть файл: %s

source: Set As Expression
ru_ru: Установить как выражение

source: Table
ru_ru: Таблица

source: Ignore undefined inputs
ru_ru: Игнорировать неопределённые входы

source: Rotate To Fit:
ru_ru: Повернуть для подгонки:

source: Matrix Rows
ru_ru: Строки матрицы

source: Library must contain at least one circuit.
ru_ru: Библиотека должна содержать хотя бы одну схему.

source: File:
ru_ru: Файл:

source: Show Attributes
ru_ru: Показать атрибуты

source: %sMB RAM
ru_ru: %sМБ ОЗУ

source: Open Error
ru_ru: Ошибка при открытии

source: JAR Library...
ru_ru: Библиотека JAR...

source: Insert Separator
ru_ru: Вставить разделитель

source: This circuit cannot be modified.
ru_ru: Эта схема не может быть изменена.

source: Save Error
ru_ru: Ошибка сохранения

source: Load Library
ru_ru: Загрузить библиотеку

source: Error while reading image file
ru_ru: Ошибка при чтении файла образа

source: Use defaults
ru_ru: Использовать умолчания

source: Label Location
ru_ru: Направление метки

source: Use NAND Gates Only
ru_ru: Использовать только элементы И-НЕ

source: Get Circuit Statistics
ru_ru: Получить статистику схемы

source: Button3
ru_ru: Кнопка3

source: Button2
ru_ru: Кнопка2

source: Add Handle
ru_ru: Добавить указатель

source: Internal error while creating XML
ru_ru: Внутренняя ошибка при создании XML

source: On Color
ru_ru: Цвет включенных

source: Subtractor
ru_ru: Вычитатель

source: Load next value
ru_ru: Загрузить следующее значение

source: Data: value stored on clock trigger
ru_ru: Данные: значение, загружаемое при срабатывании тактового входа

source: Stay at value
ru_ru: Оставаться на значении

source: Error reading file.
ru_ru: Ошибка при чтении файла.

source: Minuend: the number from which to subtract
ru_ru: Уменьшаемое: число, из которого вычитать

source: component name missing
ru_ru: отсутствует имя компонента

source: Delete
ru_ru: Удалить

source: Subcircuits will have shifted during conversion from Logisim 1.0.
ru_ru: Подсхемы будут смещены во время преобразования из Logisim 1.0.

source: Lower
ru_ru: Опустить

source: Square
ru_ru: Квадратная

source: Error during printing: %s
ru_ru: Ошибка при печати: %s

source: You must specify a circuit name.
ru_ru: Вы должны указать название схемы.

source: Top-
ru_ru: По верху

source: View component menus
ru_ru: Просматривать меню компонента

source: Adder
ru_ru: Сумматор

source: Add Toolbar Button
ru_ru: Добавить кнопку панели инструментов

source: The built-in library %s is not available in this version.
ru_ru: Встроенная библиотека %s не доступна в этой версии.

source: Data Bit Width
ru_ru: Разрядность данных

source: Cannot Load Built-In Library
ru_ru: Невозможно загрузить встроенную библиотеку

source: Replace Circuit
ru_ru: Заменить схему

source: Select
ru_ru: Выбрать

source: Anchor
ru_ru: Якорь

source: Configure the engine for simulating circuit behavior.
ru_ru: Настроить поведение движка для моделирования схемы.

source: Light Persistence
ru_ru: Продолжительность свечения

source: Button1
ru_ru: Кнопка1

source: Revert Appearance
ru_ru: Вернуть вшнешность

source: Lower To Bottom
ru_ru: Опустить вниз

source: Move Selection
ru_ru: Двигать выделение

source: Random Generator
ru_ru: Генератор случайных чисел

source: Yes
ru_ru: Да

source: Select which component values are logged.
ru_ru: Выберите, значения каких компонентов записывать в журнал.

source: Selection is empty.
ru_ru: Выбор пуст.

source: Present: 1 if input contains a %s
ru_ru: Присутствие: 1, если входное значение содержит %s

source: Logisim: Log %s of %s
ru_ru: Logisim: журнал %s из %s

source: Base-
ru_ru: По базовой

source: Remove
ru_ru: Удалить

source: Output: register's current value
ru_ru: Выход: текущее значение регистра

source: Keyboard
ru_ru: Клавиатура

source: Restart Logisim for changes to take effect.
ru_ru: Перезагрузите Logisim, чтобы изменения вступили в силу.

source: Circuit
ru_ru: Схема

source: Revert
ru_ru: Вернуть

source: Using "-load" requires a filename provided on command line.
ru_ru: Использование "-load" требует имя файла, переданное через командную строку.

source: LED
ru_ru: Светодиод

source: Output: current number in sequence
ru_ru: Выход: текущее число в последовательности

source: Octal
ru_ru: Восьмеричное

source: Change %s
ru_ru: Изменить %s

source: When an odd number are on
ru_ru: Когда на нечётном количестве 1

source: Step Simulation
ru_ru: Шаг моделирования

source: Error During Print
ru_ru: Ошибка при печати

source: J-K Flip-Flop
ru_ru: J-K триггер

source: Fill Only
ru_ru: Только заливка

source: Image file has invalid format header.
ru_ru: Файл образа имеет неверный формат заголовка.

source: Enable Output: 1 if enabled and no inputs are 1
ru_ru: Разрешающий выход: 1, если включен и ни на одном входе нет 1

source: Selection
ru_ru: Выбор

source: Edit selection and add wires
ru_ru: Редактировать выделение и добавлять провода

source: Delete Handle
ru_ru: Удалить указатель

source: The "-load" option works only in conjunction with "-tty".
ru_ru: "-load" работает только в сочетании с "-tty".

source: Using "-tty" requires a filename provided on command line.
ru_ru: Использование "-tty" требует имя файла в командной строке.

source: East
ru_ru: Восток

source: Paste Clipboard
ru_ru: Вставить буфер обмена

source: Paste Error
ru_ru: Ошибка вставки

source: Shift Type
ru_ru: Тип сдвига

source: First radix when wire poked:
ru_ru: Первое основание при нажатии на провод:

source: wire end not defined
ru_ru: конец провода не определён

source: component `%s' missing from library `%s'
ru_ru: компонент `%s' отсутствует в библиотеке `%s'

source: Wire
ru_ru: Провод

source: Project
ru_ru: Проект

source: attribute name missing
ru_ru: отсутствует название атрибута

source: GIF Files (*.gif)
ru_ru: Файлы GIF (*.gif)

source: Group Select: 1 if enabled and any input is 1
ru_ru: Выбор группы: 1, если включен и хотя бы на одном входе 1

source: Add Wire
ru_ru: Добавить провод

source: Descriptor not known for %s.
ru_ru: Дескриптор не известен для %s.

source: Reorder Circuits
ru_ru: Упорядочить схемы

source: Image file has too much information.
ru_ru: Файл образа содержит слишком много информации.

source: Not at start of group
ru_ru: Не в начале группы

source: Circuit Name:
ru_ru: Название схемы:

source: Select: identifies which group from data is selected
ru_ru: Выбирающий вход: определяет, какая группа из данных выбрана

source: Bit Width
ru_ru: Разрядность

source: Roll Right
ru_ru: Циклический правый

source: Change Selection Facing
ru_ru: Изменить направление выделения

source: Enter JAR Class
ru_ru: Ввод JAR класса

source: Conflicting output values in circuit.
ru_ru: Конфликтующие выходные значения в схеме.

source: Initializing interface...
ru_ru: Инициализация интерфейса...

source: Confirm Replace
ru_ru: Подтвердить замену

source: Splitter
ru_ru: Разветвитель

source: Count: when 1, counter increments (or decrements if Load = 1)
ru_ru: Счёт: когда 1, счётчик увеличивается (или уменьшается, если Загрузка = 1)

source: Input: value to be stored at address
ru_ru: Вход: значение, которое будет храниться по адресу

source: Loading template...
ru_ru: Загрузка шаблона...

source: Arithmetic
ru_ru: Арифметика

source: File Error
ru_ru: Ошибка файла

source: Add Tool
ru_ru: Добавить инструмент

source: Edit Circuit Layout
ru_ru: Редактировать чертёж схемы

source: The file %s contains within it a reference to itself.
ru_ru: Файл %s содержит ссылку на себя.

source: Input
ru_ru: Вход

source: Edit Contents...
ru_ru: Редактировать содержимое...

source: Not at end of group
ru_ru: Не в конце группы

source: Show tick rate
ru_ru: Показать скорость тактов

source: Dividend Upper: the upper half of the number to divide
ru_ru: Верх делимого: старшая половина числа для деления

source: Narrow
ru_ru: Узкий

source: location of component `%s' is unspecified
ru_ru: расположение компонента `%s' не задано

source: View minimized expressions corresponding to truth table.
ru_ru: Просмотреть минимизированные выражения, соответствующие таблице истинности.

source: Address Bit Width
ru_ru: Разрядность адреса

source: Logisim 1.0 J-K Flip-Flop
ru_ru: Logisim 1.0 J-K триггер

source: Appearance element %s not found
ru_ru: Элемент внешнего вида %s не найден

source: Label
ru_ru: Метка

source: JPEG Files (*.jpeg, *.jpg)
ru_ru: Файлы JPEG (*.jpeg, *.jpg)

source: Computing truth table instead of expression due to %s.
ru_ru: Вычисляется таблица истинности для %s вместо выражения.

source: Remove Vertex
ru_ru: Удалить вершину

source: Edit localization preferences
ru_ru: Редактировать настройки локализации

source: Too many colors.
ru_ru: Слишком много цветов.

source: Unique
ru_ru: Уникальных

source: Oscillation apparent
ru_ru: Обнаружено возбуждение

source: Error writing file.
ru_ru: Ошибка записи в файл.

source: Change Attribute
ru_ru: Изменить атрибут

source: Input %s
ru_ru: Вход %s

source: Edit viewed circuit's subcircuit appearance
ru_ru: Редактировать внешний вид просматриваемой схемы

source: Button
ru_ru: Кнопка

source: Memory
ru_ru: Память

source: Data: ASCII value of next character to write
ru_ru: Данные: ASCII значение следующего символа для записи

source: (none)
ru_ru: (нет)

source: Parallel Load
ru_ru: Параллельная загрузка

source: D Flip-Flop
ru_ru: D триггер

source: %s Ticks
ru_ru: %s тактов

source: %s: Options
ru_ru: %s: параметры

source: Hex Digit Display
ru_ru: Шестнадцатеричный дисплей

source: All open libraries are in use.
ru_ru: Все открытые библиотеки используются.

source: Cannot modify circuit.
ru_ru: Невозможно изменить схему.

source: Name must begin with a letter.
ru_ru: Имя должно начинаться с буквы.

source: Counter
ru_ru: Счётчик

source: Distance: how far to shift the input
ru_ru: Дистанция: на сколько сдвигать входное значение

source: Show attribute halo
ru_ru: Показывать ореол

source: No file known corresponding to %s.
ru_ru: Не известен файл, соответствующий %s.

source: Would you like to replace "%s" with Logisim's preferred ".circ" extension?
ru_ru: Хотите сменить "%s" на предпочитаемое для Logisim расширение ".circ"?

source: Cannot Export
ru_ru: Невозможно экспортировать

source: Plain template
ru_ru: Обычный шаблон

source: Move Toolbar Button
ru_ru: Переместить кнопку панели инструментов

source: Move %s
ru_ru: Переместить %s

source: Unsigned
ru_ru: Беззнаковое

source: Input: one of the numbers to add
ru_ru: Вход: одно из чисел для сложения

source: Probe
ru_ru: Датчик

source: Argument for -accents option must be "yes" or "no".
ru_ru: Аргумент для параметра -accents должен быть "yes" или "no".

source: %s subcircuit
ru_ru: Подсхема %s

source: -accents yes|no use accented characters or ASCII equivalents
ru_ru: -accents yes|no использовать специфичные символы или ASCII эквиваленты

source: Trigger
ru_ru: Срабатывание

source: Cancel
ru_ru: Отмена

source: Iterations until oscillation
ru_ru: Итераций до возбуждения

source: %s: Log
ru_ru: %s: журнал

source: Simulation Enabled
ru_ru: Моделирование включено

source: (click to edit)
ru_ru: (нажмите чтобы редактировать)

source: Falling Edge
ru_ru: Задний фронт

source: 7-Segment Display
ru_ru: 7-сегментный дисплей

source: Load JAR File
ru_ru: Загрузить JAR файл

source: Unchanged
ru_ru: Не менять

source: Complement of current flip-flop state
ru_ru: Дополнение текущего состояния триггера

source: Remove Toolbar Button
ru_ru: Удалить кнопку панели инструментов

source: Load Error
ru_ru: Ошибка загрузки

source: Pin Attached To Supercircuit.
ru_ru: Контакт подключен к надсхеме.

source: Chip select: 0 disables component
ru_ru: Выбор кристалла: 0 выключает компонент

source: Export Image...
ru_ru: Экспортировать изображение...

source: Clear: When 1, resets to initial seed asynchronously
ru_ru: Очистка: когда 1, асинхронно сбрасывает на начальное семя

source: Borrow Out: 1 if the difference yields a negative value
ru_ru: Выход займа: 1, если разность даёт отрицательное значение

source: %sMB ROM
ru_ru: %sМБ ПЗУ

source: Input/Output
ru_ru: Ввод/вывод

source: Input: value to be shifted into first stage
ru_ru: Вход: значение для сдвига в первую ступень

source: Data
ru_ru: Данные

source: doc/doc_en.hs
ru_ru: doc/doc_ru.hs

source: Open...
ru_ru: Открыть...

source: Top
ru_ru: Сверху

source: Analysis cannot handle more than %s outputs.
ru_ru: Анализ не может манипулировать более чем %s выходами.

source: Priority Encoder
ru_ru: Шифратор приоритетов

source: What should happen to your unsaved changes to %s?
ru_ru: Что должно произойти с вашими несохранёнными изменениями в %s?

source: No Tool Selected
ru_ru: Инструмент не выбран

source: Clear: 1 empties buffer
ru_ru: Очистка: 1 очищает буфер

source: Move Circuit Down
ru_ru: Переместить схему вниз

source: Closing template...
ru_ru: Закрытие шаблона...

source: Toolbar location:
ru_ru: Расположение панели инструментов:

source: Left
ru_ru: Слева
